{
  "main": {
    "name":"Jamal Browning",
    "occupation":"Software Engineer",
    "description":"I enjoy working on a team, researching new ways to be more effiecient, playing pickleball, and design.",
    "image":"profilepic.png",
    "bio":"My name is Jamal, but most people call me Jim. I am a full-stack web developer working primarily with React JS, Python Django-Rest, and SQL. I am passionate about developing applications to solve real-world problems.  My professional background is in project management within the Residential Real Estate field. I have a knack for problem-solving and enjoy consistently learning new ways to solve problems.",
    "contactmessage":"Feel free to contact me at ",
    "email": "jamalebrowning@gmail.com",
    "phone": "615.308.9986",
    "address":{
      "street":"(Your Street)",
      "city":"Nashville",
      "state":"TN",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/12vuLt7Mr4yaETgJX4xDj0gb26zwMs2tW/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com/tim.baker.906",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jamalbrowning/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/jamalebrowning",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/jamalbrowning",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"http://skype.com",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Nashville Software School",
        "degree":"Software Engineering",
        "graduated":"March 2021",
        "description":"Applied fundamentals of object-oriented programming through group and individual projects. Utilized asynchronous JavaScript and jQuery methods to interact with external APIs and a local API (JSON server). Gained a firm understanding of workflow technologies using github. Learned and applied principles of entity-relationship diagrams to visualize data structures. Constructed, queried, and manipulated database structures using SQLite3 and postgreSQL.Developed back-end applications and a RESTful API using Python and Django and implemented unit testing suites. Developed Front-End Web Applications using React.js."
      },
      {
        "school":"Florida International University",
        "degree":"International Business",
        "graduated":"",
        "description":""
      }
    ],
    "work":[
      {
        "company":"Nashville Software School",
        "title":"Software Engineer",
        "years":"April 2020 - Present",
        "description":"Intensive part-time 12-month Software Engineering Program learning full-stack technologies through personal and group projects."
      },
      {
        "company":"LASU LLC",
        "title":"Project Manager",
        "years":"Jan 2017 - Present",
        "description":"I managed Remodel Budgets up to $250,000. Designed Interior and Exterior remodel schematics. Organized and ran projects from start to finish. Managed up to 10 sub-contractor teams per project. Maintained and updated progress reports for Executives using Notion(Data/project management). Handled Inspection criteria with Real Estate agents."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"80%"
      },
      {
        "name":"Illustrator",
        "level":"55%"
      },
      {
        "name":"React.Js",
        "level":"60%"
      },
      {
        "name":"CSS3",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"Python",
        "level":"50%"
      },
      {
        "name":"BootStrap",
        "level":"80%"
      },
      {
        "name":"Adobe XD",
        "level":"65%"
      },
      {
        "name":"Javascript",
        "level":"65%"
      },
      {
        "name":"Dbdiagram",
        "level":"65%"
      },
      {
        "name":"firebase",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"qortr",
        "category":"Easy to use application that generates Covid-friendly Dates",
        "image":"qortr.png",
        "url":"https://www.qortr.com",
        "ghub":"https://github.com/jamalbrowning/qortr"
      },
      {
        "title":"Pan-Am",
        "category":"This an Aviation Dashboard created for the Historic Pan-Am Airways.",
        "image":"Pan-Am.png",
        "url":"https://panam-10421.web.app/",
        "ghub":"https://github.com/jamalbrowning/nutshell-alces"
      }
    
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Jim and I have collaborated together on both frontend and backend projects, and I've really enjoyed being on a team with him. He is a self-disciplined, hard worker who stays on task to get the job done, but he still always makes time to offer help to anyone else in the group when it's needed. Jim has a great eye for design and made our frontend project look so professional with his branding and styling. He is a genuinely kind person who is fun to work with and easy to get along with. Jim would make a great addition to anyone's team.",
        "user":"Jeanine Beckle - Content Manager @ Talanoa Group"
      },
      {
        "text":"I worked on a team project with Jim and he was fantastic to work with. He wrote clean code that was easy to read and understand. He pitched in and assisted our other team members when they asked for help. He wasn't shy about diving in and taking on extra tickets when he finished his assigned ones showing great initiative. He managed his time well and was able to get alot done.",
        "user":"Joshua Medlen - Nashville Software School"
      }
    ]
  }
}
